Repository: SelfPrivacy/selfprivacy-api
Catalog: selfprivacy_api/locale/*/LC_MESSAGES/messages.po
Languages: ru

source: Move %(service)s
ru: Перемещение %(service)s

source: Moving %(service)s data to %(volume)s
ru: Перемещение данных %(service)s на %(volume)s

source: Rebuild system
ru: Пересборка системы

source: Applying the new system configuration by building the new NixOS generation.
ru: Применение новой конфигурации системы путём сборки новой генерации NixOS.

source: Upgrade system
ru: Обновление системы

source: Upgrading the system to the latest version.
ru: Обновление системы до последней версии.

source: Job removed
ru: Задача удалена

source: Job not found
ru: Задача не найдена

source: Recovery key generated
ru: Ключ восстановления сгенерирован

source: Recovery key used
ru: Ключ восстановления использован

source: Token refreshed
ru: Токен обновлён

source: Token deleted
ru: Токен удалён

source: Device api key generated
ru: Сгенерирован API ключ устройства

source: New device key deleted
ru: Ключ нового устройства удалён

source: Token used
ru: Токен использован

source: Restore job created
ru: Задача восстановления создана

source: Nonexistent service:
ru: Несуществующий сервис:

source: Snapshot not found with id:
ru: Снимок с указанным ID не найден:

source: Trimming autobackup snapshots
ru: Очистка снимков автокопий

source: Pruning the excessive snapshots after the new autobackup quotas are set
ru: Удаление лишних снимков после установки новых квот автокопий

source: Backup job queued
ru: Задача резервного копирования поставлена в очередь

source: Total backup task queued
ru: Задача полного резервного копирования поставлена в очередь

source: Password deleted successfully
ru: Пароль успешно удалён

source: Timezone changed
ru: Часовой пояс изменён

source: Auto-upgrade settings changed
ru: Настройки автообновления изменены

source: SSH settings changed
ru: Настройки SSH изменены

source: Starting system rebuild
ru: Запуск пересборки системы

source: Starting system upgrade
ru: Запуск обновления системы

source: System reboot has started
ru: Перезапуск системы начат

source: There is no repository to pull changes from.
ru: Нет репозитория, из которого можно получить изменения.

source: Garbage collector started...
ru: Сборщик мусора запущен...

source: Provider set
ru: Провайдер установлен

source: New password applied an an email password. To use Single Sign On, please update the SelfPrivacy app.
ru: Новый пароль применён как пароль электронной почты. Чтобы использовать единый вход (SSO), обновите приложение SelfPrivacy.

source: User created
ru: Пользователь создан

source: User deleted
ru: Пользователь удалён

source: User updated
ru: Пользователь обновлён

source: New SSH key successfully written
ru: Новый ключ SSH успешно записан

source: SSH key successfully removed
ru: Ключ SSH успешно удалён

source: Link successfully created
ru: Ссылка успешно создана

source: Volume not found
ru: Том не найден

source: Volume resize started
ru: Изменение размера тома запущено

source: Volume mounted, rebuild the system to apply changes
ru: Том смонтирован, пересоберите систему для применения изменений

source: Volume not mounted (already mounted?)
ru: Том не смонтирован (возможно, уже смонтирован)

source: Volume unmounted, rebuild the system to apply changes
ru: Том размонтирован, пересоберите систему для применения изменений

source: Volume not unmounted (already unmounted?)
ru: Том не размонтирован (возможно, уже размонтирован)

source: Already migrated to binds
ru: Уже используется новая схема хранения.

source: Migration to binds started, rebuild the system to apply changes
ru: Начат переход на новую схему хранения. Пересоберите систему, чтобы применить изменения.

source: Service not found
ru: Сервис не найден

source: Service enabled.
ru: Сервис включён.

source: Service disabled.
ru: Сервис выключен.

source: Service stopped.
ru: Сервис остановлен.

source: Service started.
ru: Сервис запущен.

source: Service restarted.
ru: Сервис перезапущен.

source: Service does not exist: %(service_id)s
ru: Сервис не существует: %(service_id)s

source: Service configuration updated.
ru: Настройки сервиса обновлены.

source: Started moving the service.
ru: Начат перенос сервиса.

source: Service moved.
ru: Сервис перемещён.

source: While moving service and performing the step '%(status_text)s', an error occurred: %(error)s
ru: При переносе сервиса на шаге «%(status_text)s» произошла ошибка: %(error)s

source: Prometheus is not running
ru: Prometheus не запущен

source: Starting the system rebuild...
ru: Запуск пересборки системы...

source: System rebuild timed out. Last log lines:
ru: Время пересборки системы истекло. Последние строки лога:

source: Rebuilding the system...
ru: Пересборка системы...

source: System rebuilt.
ru: Система пересобрана.

source: System rebuild failed. Last log lines:
ru: Сбой пересборки системы. Последние строки лога:

source: Migration already done.
ru: Миграция уже выполнена.

source: Checking if services are present.
ru: Проверка наличия сервисов.

source: Nextcloud service not found.
ru: Сервис Nextcloud не найден.

source: Bitwarden service not found.
ru: Сервис Bitwarden не найден.

source: Gitea service not found.
ru: Сервис Gitea не найден.

source: Pleroma service not found.
ru: Сервис Pleroma не найден.

source: Checking if all volumes are available.
ru: Проверка доступности всех томов.

source: Block device %(block_device_name)s not found.
ru: Блочное устройство %(block_device_name)s не найдено.

source: Block device %(block_device_name)s not mounted.
ru: Блочное устройство %(block_device_name)s не смонтировано.

source: Activating binds in NixOS config.
ru: Включаем новую схему хранения в конфигурации NixOS.

source: Migrating Nextcloud.
ru: Миграция Nextcloud.

source: Migrating Bitwarden.
ru: Миграция Bitwarden.

source: Migrating Gitea.
ru: Миграция Gitea.

source: Migrating Mail server.
ru: Миграция почтового сервера.

source: Migrating Pleroma.
ru: Миграция Pleroma.

source: Migration finished.
ru: Миграция завершена.

source: Migrate to binds
ru: Переход на новую схему хранения

source: Migration required to use the new disk space management.
ru: Чтобы использовать новое управление местом на диске, нужен переход на новую схему хранения.

source: Garbage collection completed.
ru: Очистка завершена.

source: %(size_in_megabytes)s have been cleared
ru: %(size_in_megabytes)s удалено

source: Cleaning...
ru: Очистка...

source: Calculate the number of dead packages...
ru: Подсчёт количества неиспользуемых пакетов...

source: Nothing to clear
ru: Нечего очищать

source: System is clear
ru: Система чистая

source: Found %(dead_packages)s packages to remove!
ru: Найдено %(dead_packages)s пакетов для удаления!

source: Garbage collection failed
ru: Очистка завершилась с ошибкой

source: Collect garbage
ru: Очистка системы

source: Cleaning up unused packages
ru: Очистка неиспользуемых пакетов

source: No description found!
ru: Описание не найдено!

source: No backup description found!
ru: Описание резервной копии не найдено!

source: Automatic backup
ru: Автоматическое резервное копирование

source: Scheduled backup for services: %(pretty_service_list)s
ru: Запланированное резервное копирование для сервисов: %(pretty_service_list)s

source: Cannot start a backup of %(service_id)s, another operation is running: %(op_type)s
ru: Нельзя запустить резервное копирование %(service_id)s, выполняется другая операция: %(op_type)s

source: Backup %(display_name)s
ru: Резервное копирование %(display_name)s

source: Backing up %(display_name)s
ru: Создание резервной копии %(display_name)s

source: Cannot start a restore of %(service_id)s, another operation is running: %(op_type)s
ru: Нельзя запустить восстановление %(service_id)s, выполняется другая операция: %(op_type)s

source: Total restore
ru: Полное восстановление

source: Restoring all enabled services
ru: Восстановление всех включённых сервисов

source: Total backup
ru: Полное резервное копирование

source: Backing up all the enabled services
ru: Резервное копирование всех включённых сервисов

source: Restore %(display_name)s
ru: Восстановление %(display_name)s

source: Restoring %(display_name)s from %(snapshot_id)s
ru: Восстановление %(display_name)s из %(snapshot_id)s

source: Finding the last autobackup session
ru: Поиск последней сессии автоматического резервного копирования

source: restoring %(service_name)s
ru: восстановление %(service_name)s

source: rebuilding system
ru: пересборка системы

source: Your SelfPrivacy app is out of date, please update it to use new features.
ru: Ваше приложение SelfPrivacy устарело; обновите его, чтобы использовать новые функции.

source: Please report it to our support chats: #chat:selfprivacy.org on Matrix or @selprivacy_chat on Telegram.
ru: Пожалуйста, сообщите об этом в наши чаты поддержки: #chat:selfprivacy.org в Matrix или @selprivacy_chat в Telegram.

source: Kanidm is the identity and authentication service that manages users and access to services.
ru: Kanidm — это сервис идентификации и аутентификации, который управляет пользователями и доступом к сервисам.

source: In some cases, a Kanidm update may introduce breaking changes affecting the API, CLI commands, or configuration compatibility.
ru: В некоторых случаях обновление Kanidm может внести несовместимые изменения, затрагивающие API, команды CLI или совместимость конфигурации.

source: Console commands to debug: 'systemctl status kanidm.service' 'journalctl -u kanidm.service'
ru: Консольные команды для отладки: 'systemctl status kanidm.service' 'journalctl -u kanidm.service'

source: The API is using the wrong user repository.
ru: API использует неверный репозиторий пользователей.

source: No such service: %(service_id)s. %(REPORT_IT_TO_SUPPORT_CHATS)s
ru: Нет такого сервиса: %(service_id)s. %(REPORT_IT_TO_SUPPORT_CHATS)s

source: No such volume: %(volume_name)s. %(REPORT_IT_TO_SUPPORT_CHATS)s
ru: Нет такого тома: %(volume_name)s. %(REPORT_IT_TO_SUPPORT_CHATS)s

source: Command execution failed. %(description)s %(REPORT_IT_TO_SUPPORT_CHATS)s Executed command: %(command)s Output: %(output)s
ru: Команда завершилась с ошибкой. %(description)s %(REPORT_IT_TO_SUPPORT_CHATS)s Выполненная команда: %(command)s Вывод: %(output)s

source: Invalid timezone: %(timezone)s Timezone not in pytz.all_timezones. List of available timezones: https://data.iana.org/time-zones/data/zone.tab
ru: Недопустимый часовой пояс: %(timezone)s Часовой пояс отсутствует в pytz.all_timezones. Список доступных часовых поясов: https://data.iana.org/time-zones/data/zone.tab

source: %(description)s %(REPORT_IT_TO_SUPPORT_CHATS)s Command: %(command)s Used regex pattern: %(regex_pattern)s Data: %(data)s
ru: %(description)s %(REPORT_IT_TO_SUPPORT_CHATS)s Команда: %(command)s Использованный шаблон regex: %(regex_pattern)s Данные: %(data)s

source: Access token was not found. %(REPORT_IT_TO_SUPPORT_CHATS)s
ru: Токен доступа не найден. %(REPORT_IT_TO_SUPPORT_CHATS)s

source: Recovery key is not found or no longer valid. %(REPORT_IT_TO_SUPPORT_CHATS)s
ru: Ключ восстановления не найден или больше не действителен. %(REPORT_IT_TO_SUPPORT_CHATS)s

source: Invalid recovery key. %(REPORT_IT_TO_SUPPORT_CHATS)s
ru: Недействительный ключ восстановления. %(REPORT_IT_TO_SUPPORT_CHATS)s

source: New device key not found. %(REPORT_IT_TO_SUPPORT_CHATS)s
ru: Ключ нового устройства не найден. %(REPORT_IT_TO_SUPPORT_CHATS)s

source: The access token you’re trying to delete is currently in use by this device, so removing access is not possible. %(REPORT_IT_TO_SUPPORT_CHATS)s
ru: Токен доступа, который вы пытаетесь удалить, сейчас используется этим устройством, поэтому отключить доступ невозможно. %(REPORT_IT_TO_SUPPORT_CHATS)s

source: Specified expiration date is in the past. Please provide a future date. If you believe this is a mistake, there may be a problem with the server's date/time settings.
ru: Указанная дата истечения уже прошла. Укажите дату в будущем. Если вы считаете, что это ошибка, возможно, на сервере неверно настроены дата/время.

source: Uses left must be greater than 0.
ru: Оставшееся количество использований должно быть больше 0.

source: User not found
ru: Пользователь не найден

source: User or group not found. Kanidm uses the same error for missing users and groups.%(KANIDM_DESCRIPTION)s
ru: Пользователь или группа не найдены. Kanidm использует одну и ту же ошибку для отсутствующих пользователей и групп. %(KANIDM_DESCRIPTION)s

source: Root user cannot be deleted or modified.
ru: Суперпользователь не может быть удалён или изменён.

source: Username is in reserved list or have reserved prefix. Reserved prefix: %(forbidden_prefix)s.
ru: Имя пользователя находится в списке зарезервированных или имеет зарезервированный префикс. Зарезервированный префикс: %(forbidden_prefix)s.

source: Username is in reserved list or have reserved prefix.
ru: Имя пользователя находится в списке зарезервированных или имеет зарезервированный префикс.

source: User already exists
ru: Пользователь уже существует

source: Username must be alphanumeric and start with a letter.
ru: Имя пользователя должно состоять из букв и цифр и начинаться с буквы.

source: Username is too long. Must be less than 32 characters.
ru: Имя пользователя слишком длинное. Должно быть меньше 32 символов.

source: Password cannot be empty.
ru: Пароль не может быть пустым.

source: Display name is too long. Must be less than 256 characters.
ru: Отображаемое имя слишком длинное. Должно быть меньше 256 символов.

source: An error occurred during a request to Kanidm. %(KANIDM_DESCRIPTION)s %(description)s %(REPORT_IT_TO_SUPPORT_CHATS)s Endpoint: %(endpoint)s Method: %(method)s Error: %(error)s
ru: Произошла ошибка при запросе к Kanidm. %(KANIDM_DESCRIPTION)s %(description)s %(REPORT_IT_TO_SUPPORT_CHATS)s Эндпоинт: %(endpoint)s Метод: %(method)s Ошибка: %(error)s

source: Kanidm returned an empty response. %(KANIDM_DESCRIPTION)s %(REPORT_IT_TO_SUPPORT_CHATS)s Endpoint: %(endpoint)s Method: %(method)s
ru: Kanidm вернул пустой ответ. %(KANIDM_DESCRIPTION)s %(REPORT_IT_TO_SUPPORT_CHATS)s Эндпоинт: %(endpoint)s Метод: %(method)s

source: Kanidm returned an unknown type response. %(KANIDM_DESCRIPTION)s %(KANIDM_PROBLEMS)s %(REPORT_IT_TO_SUPPORT_CHATS)s Endpoint: %(endpoint)s Method: %(method)s Response: %(response)s
ru: Kanidm вернул ответ неизвестного типа. %(KANIDM_DESCRIPTION)s %(KANIDM_PROBLEMS)s %(REPORT_IT_TO_SUPPORT_CHATS)s Эндпоинт: %(endpoint)s Метод: %(method)s Ответ: %(response)s

source: Failed to get access to Kanidm admin account: Kanidm CLI did not reset the admin password. %(KANIDM_DESCRIPTION)s %(KANIDM_PROBLEMS)s %(REPORT_IT_TO_SUPPORT_CHATS)s %(KANIDM_DEBUG_HELP)s Used command: %(command)s Used regex pattern: %(regex_pattern)s Kanidm's CLI output: %(output)s
ru: Не удалось получить доступ к учётной записи администратора Kanidm: Kanidm CLI не сбросил пароль администратора. %(KANIDM_DESCRIPTION)s %(KANIDM_PROBLEMS)s %(REPORT_IT_TO_SUPPORT_CHATS)s %(KANIDM_DEBUG_HELP)s Использованная команда: %(command)s Использованный шаблон regex: %(regex_pattern)s Вывод Kanidm CLI: %(output)s

source: Error creating Kanidm token
ru: Ошибка при создании токена Kanidm

source: Kanidm CLI returned an error. %(KANIDM_DESCRIPTION)s %(description)s %(KANIDM_PROBLEMS)s %(REPORT_IT_TO_SUPPORT_CHATS)s Used command: %(command)s Error: %(error)s
ru: Kanidm CLI вернул ошибку. %(KANIDM_DESCRIPTION)s %(description)s %(KANIDM_PROBLEMS)s %(REPORT_IT_TO_SUPPORT_CHATS)s Использованная команда: %(command)s Ошибка: %(error)s

source: Сouldn't get a valid Kanidm token. %(KANIDM_DESCRIPTION)s %(KANIDM_PROBLEMS)s %(REPORT_IT_TO_SUPPORT_CHATS)s
ru: Не удалось получить действительный токен Kanidm. %(KANIDM_DESCRIPTION)s %(KANIDM_PROBLEMS)s %(REPORT_IT_TO_SUPPORT_CHATS)s

source: Kanidm didn't return a password reset link. %(KANIDM_DESCRIPTION)s Failed to find "token" in data. %(REPORT_IT_TO_SUPPORT_CHATS)s Endpoint: %(endpoint)s Method: %(method)s Data: %(data)s
ru: Kanidm не вернул ссылку для сброса пароля. %(KANIDM_DESCRIPTION)s Не удалось найти "token" в данных. %(REPORT_IT_TO_SUPPORT_CHATS)s Эндпоинт: %(endpoint)s Метод: %(method)s Данные: %(data)s

source: Key not found
ru: Ключ не найден

source: Key already exists
ru: Ключ уже существует

source: Invalid key type. Supported key types:
ru: Недопустимый тип ключа. Поддерживаемые типы ключей:

source: Kanidm is not responding to requests. Connection error.
ru: Kanidm не отвечает на запросы. Ошибка подключения.

source: Unknown error while checking the Kanidm admin token.
ru: Неизвестная ошибка при проверке администраторского токена Kanidm.

source: No JSON found in Kanidm response.
ru: В ответе Kanidm не найден JSON.

source: Kanidm is not responding to requests.
ru: Kanidm не отвечает на запросы.

source: Kanidm access issue
ru: Проблема доступа к Kanidm
